queens_aaa_workflow/openfoam_cases/case_002/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (-42.267064 -25.469194 -61.812971)
    (81.052496 -25.469194 -61.812971)
    (81.052496 155.181189 -61.812971)
    (-42.267064 155.181189 -61.812971)
    (-42.267064 -25.469194 61.812971)
    (81.052496 -25.469194 61.812971)
    (81.052496 155.181189 61.812971)
    (-42.267064 155.181189 61.812971)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (247 362 248) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    world
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);
